In [61]:
# example making new folder with os
import os
os.makedirs('Data/',exist_ok=True) 
import pymysql
pymysql.install_as_MySQLdb()

In [62]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from urllib.parse import quote_plus
from sqlalchemy import text
import json

In [63]:
# Confirm folder was created and files added successfully
os.listdir("Data/")

['.ipynb_checkpoints',
 'basics.csv',
 'IMDB Movie Dataset Info.docx',
 'ratings.csv',
 'title-akas-us-only.csv',
 'title.basics.tsv.gz',
 'title.ratings.tsv.gz']

## Importing title.akas

In [64]:
akas = pd.read_csv('Data/title-akas-us-only.csv', low_memory=False)

In [65]:
akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1452564 entries, 0 to 1452563
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1452564 non-null  object
 1   ordering         1452564 non-null  int64
 2   title            1452564 non-null  object
 3   region           1452564 non-null  object
 4   language         1452564 non-null  object
 5   types            1452564 non-null  object
 6   attributes       1452564 non-null  object
 7   isOriginalTitle  1452564 non-null  object
dtypes: int64(1), object(7)
memory usage: 88.7+ MB

## Importing title.basics

In [66]:
basics = pd.read_csv('Data/title.basics.tsv.gz', sep='\t', low_memory=False)

In [67]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10017011 entries, 0 to 10017010
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 687.8+ MB

In [68]:
# Filter the basics table down to only include the US by using the filter akas dataframe
filter_us_titles = basics['tconst'].isin(akas['titleId'])
basics = basics[filter_us_titles]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,\N,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,\N,1,"Short,Sport"
...,...,...,...,...,...,...,...,...,...
10016872,tt9916560,tvMovie,March of Dimes Presents: Once Upon a Dime,March of Dimes Presents: Once Upon a Dime,0,1963,\N,58,Family
10016901,tt9916620,movie,The Copeland Case,The Copeland Case,0,\N,\N,\N,Drama
10016939,tt9916702,short,Loving London: The Playground,Loving London: The Playground,0,\N,\N,\N,"Drama,Short"
10016962,tt9916756,short,Pretty Pretty Black Girl,Pretty Pretty Black Girl,0,2019,\N,\N,Short
10016966,tt9916764,short,38,38,0,2018,\N,\N,Short

In [69]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,\N,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,\N,1,"Short,Sport"

## Preprocessing steps for title basics

In [70]:
## changing \N to actual Nan values

In [71]:
basics = basics.replace({'\\N':np.nan})

In [72]:
## dropping Nan's from runtimeMinutes and genres columns

In [73]:
basics.dropna(subset=['runtimeMinutes', 'genres'], inplace=True)

In [74]:
## creating filters to keep only movie in titletype, and remove documentary from genres

In [75]:
filter_titletype = basics['titleType'].str.contains('movie')
filter_documentaries = basics['genres'].str.contains('Documentary')

In [76]:
basics = basics[~filter_documentaries]

In [77]:
basics = basics[filter_titletype]

C:\Users\Admin\AppData\Local\Temp\ipykernel_72600\2716687499.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  basics = basics[filter_titletype]

In [78]:
# verifying changes

In [79]:
basics['genres'].value_counts()

Drama                        30948
Comedy                       13170
Comedy,Drama                  6332
Horror                        5535
Drama,Romance                 5479
                             ...
Action,Mystery,War               1
Animation,Musical,Romance        1
Drama,News,Thriller              1
Fantasy,Music,Mystery            1
Biography,Fantasy,Musical        1
Name: genres, Length: 1058, dtype: int64

In [80]:
basics['titleType'].value_counts()

movie    162615
Name: titleType, dtype: int64

In [81]:
# change startYear dtype to float

In [82]:
basics['startYear'] = basics['startYear'].astype(float)

In [83]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 162615 entries, 8 to 10016777
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          162615 non-null  object
 1   titleType       162615 non-null  object
 2   primaryTitle    162615 non-null  object
 3   originalTitle   162615 non-null  object
 4   isAdult         162615 non-null  object
 5   startYear       159998 non-null  float64
 6   endYear         0 non-null       object
 7   runtimeMinutes  162615 non-null  object
 8   genres          162615 non-null  object
dtypes: float64(1), object(8)
memory usage: 12.4+ MB

In [84]:
# filter to only keep movies between startyear 2000 and 2022

In [85]:
filter_startyear = (basics['startYear'] >=2000.0) & (basics['startYear'] <=2022.0)

In [86]:
basics = basics[filter_startyear]

In [87]:
## final info check to view rows count

In [88]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 86979 entries, 34802 to 10016777
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  object
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      object
 7   runtimeMinutes  86979 non-null  object
 8   genres          86979 non-null  object
dtypes: float64(1), object(8)
memory usage: 6.6+ MB

In [89]:
## export dataframe to csv in data folder

In [90]:
basics.to_csv(r'Data\basics.csv')

## Load and filter the title ratings file

In [91]:
ratings = pd.read_csv('Data/title.ratings.tsv.gz', sep='\t', low_memory=False)

In [92]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1331492 entries, 0 to 1331491
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1331492 non-null  object
 1   averageRating  1331492 non-null  float64
 2   numVotes       1331492 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 30.5+ MB

In [93]:
filter_basics = ratings['tconst'].isin(basics['tconst'])
ratings = ratings[filter_basics]

In [94]:
ratings = ratings.replace({'\\N':np.nan})

In [95]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 71900 entries, 17961 to 1331462
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.2+ MB

In [96]:
ratings.to_csv(r'Data\ratings.csv')

## Part 2

### Hiding MySQL password

In [97]:
with open('/Users/Admin/.secret/sql_password.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['password'])

### Setting up connection and engine

In [98]:
username = 'root'
password = login['password']
db_name = 'movie'
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
engine = create_engine(connection)
conn = engine.connect()

In [99]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movie
0          genres
1         ratings
2    title_basics
3    title_genres

In [100]:
q = '''DESCRIBE title_basics;'''
describe_genres = pd.read_sql(q, conn)
describe_genres

,Field,Type,Null,Key,Default,Extra
0,tconst,char(10),NO,PRI,None,
1,primary_title,varchar(250),YES,,None,
2,start_year,float,YES,,None,
3,created_on,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
4,updated_on,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
5,runtime,int,YES,,None,

In [101]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 86979 entries, 34802 to 10016777
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  object
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      object
 7   runtimeMinutes  86979 non-null  object
 8   genres          86979 non-null  object
dtypes: float64(1), object(8)
memory usage: 6.6+ MB

### Verifying lengths of features for SQL Script

In [102]:
basics['tconst'].map(len).max()

10

In [103]:
basics['primaryTitle'].map(len).max()

242

In [104]:
basics['genres'].map(len).max()

29

In [105]:
rename_map = {'runtimeMinutes':'runtime',
              'primaryTitle':'primary_title',
              'startYear':'start_year',}

In [106]:
basics = basics.rename(rename_map,axis=1)

In [107]:
basics.duplicated().sum()

0

In [108]:
basics = basics.drop(columns='titleType')
basics = basics.drop(columns='originalTitle')
basics = basics.drop(columns='isAdult')
basics = basics.drop(columns='endYear')
basics = basics.drop(columns='genres')

In [109]:
q = '''DESCRIBE ratings;'''
describe_ratings = pd.read_sql(q, conn)
describe_ratings

,Field,Type,Null,Key,Default,Extra
0,tconst,char(10),NO,,None,
1,number_of_votes,int,YES,,None,
2,created_on,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,updated_on,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
4,average_rating,float,YES,,None,

In [110]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 71900 entries, 17961 to 1331462
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.2+ MB

In [111]:
ratings.duplicated().sum()

0

In [112]:
ratings['tconst'].value_counts()

tt0035423     1
tt3322940     1
tt3324494     1
tt3323940     1
tt3323920     1
             ..
tt13356020    1
tt13356884    1
tt13357042    1
tt13357236    1
tt9916362     1
Name: tconst, Length: 71900, dtype: int64

In [113]:
rename_map_2 = {'averageRating':'average_rating',
              'numVotes':'number_of_votes'}

In [114]:
ratings = ratings.rename(rename_map_2,axis=1)

In [115]:
ratings.head()

          tconst  average_rating  number_of_votes
17961  tt0035423             6.4            87153
40764  tt0062336             6.4              175
46645  tt0069049             6.7             7754
63640  tt0088751             5.2              336
69953  tt0096056             5.6              846

In [116]:
basics.head()

,tconst,primary_title,start_year,runtime
34802,tt0035423,Kate & Leopold,2001.0,118
61114,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
67666,tt0069049,The Other Side of the Wind,2018.0,122
86793,tt0088751,The Naked Monster,2005.0,100
93930,tt0096056,Crime and Punishment,2002.0,126

In [117]:
basics.loc[34802]

tconst                tt0035423
primary_title    Kate & Leopold
start_year               2001.0
runtime                     118
Name: 34802, dtype: object

### Filling SQL Tables with DataFrames

In [118]:
basics.to_sql("title_basics",conn,index=False, if_exists='append')

86979

In [119]:
ratings.to_sql("ratings",conn,index=False, if_exists='append')

71900

In [120]:
q = """SHOW TABLES"""
pd.read_sql(q, conn)

  Tables_in_movie
0          genres
1         ratings
2    title_basics
3    title_genres

In [121]:
q = '''DESCRIBE ratings;'''
describe_ratings = pd.read_sql(q, conn)
describe_ratings

,Field,Type,Null,Key,Default,Extra
0,tconst,char(10),NO,,None,
1,number_of_votes,int,YES,,None,
2,created_on,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,updated_on,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
4,average_rating,float,YES,,None,

In [122]:
q = '''DESCRIBE title_basics;'''
describe_ratings = pd.read_sql(q, conn)
describe_ratings

,Field,Type,Null,Key,Default,Extra
0,tconst,char(10),NO,PRI,None,
1,primary_title,varchar(250),YES,,None,
2,start_year,float,YES,,None,
3,created_on,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
4,updated_on,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
5,runtime,int,YES,,None,

In [123]:
q = '''SELECT * FROM ratings;'''
describe_ratings = pd.read_sql(q, conn)
describe_ratings

,tconst,number_of_votes,created_on,updated_on,average_rating
0,tt0035423,87153,2023-10-05 17:57:22,2023-10-05 17:57:22,6.4
1,tt0062336,175,2023-10-05 17:57:22,2023-10-05 17:57:22,6.4
2,tt0069049,7754,2023-10-05 17:57:22,2023-10-05 17:57:22,6.7
3,tt0088751,336,2023-10-05 17:57:22,2023-10-05 17:57:22,5.2
4,tt0096056,846,2023-10-05 17:57:22,2023-10-05 17:57:22,5.6
...,...,...,...,...,...
71895,tt9914942,178,2023-10-05 17:57:25,2023-10-05 17:57:25,6.6
71896,tt9915872,9,2023-10-05 17:57:25,2023-10-05 17:57:25,6.4
71897,tt9916170,7,2023-10-05 17:57:25,2023-10-05 17:57:25,7.0
71898,tt9916190,243,2023-10-05 17:57:25,2023-10-05 17:57:25,3.7
71899,tt9916362,5422,2023-10-05 17:57:25,2023-10-05 17:57:25,6.4

In [124]:
q = '''SELECT * FROM title_basics;'''
describe_ratings = pd.read_sql(q, conn)
describe_ratings

,tconst,primary_title,start_year,created_on,updated_on,runtime
0,tt0035423,Kate & Leopold,2001.0,2023-10-05 17:57:17,2023-10-05 17:57:17,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,2023-10-05 17:57:17,2023-10-05 17:57:17,70
2,tt0069049,The Other Side of the Wind,2018.0,2023-10-05 17:57:17,2023-10-05 17:57:17,122
3,tt0088751,The Naked Monster,2005.0,2023-10-05 17:57:17,2023-10-05 17:57:17,100
4,tt0096056,Crime and Punishment,2002.0,2023-10-05 17:57:17,2023-10-05 17:57:17,126
...,...,...,...,...,...,...
86974,tt9914942,Life Without Sara Amat,2019.0,2023-10-05 17:57:21,2023-10-05 17:57:21,74
86975,tt9915872,The Last White Witch,2019.0,2023-10-05 17:57:21,2023-10-05 17:57:21,97
86976,tt9916170,The Rehearsal,2019.0,2023-10-05 17:57:21,2023-10-05 17:57:21,51
86977,tt9916190,Safeguard,2020.0,2023-10-05 17:57:21,2023-10-05 17:57:21,95
86978,tt9916362,Coven,2020.0,2023-10-05 17:57:21,2023-10-05 17:57:21,92

### Test Query for Top 10 Moves With Most Votes

In [125]:
q = """SELECT primary_title, number_of_votes
FROM title_basics
JOIN ratings 
ON title_basics.tconst = ratings.tconst
WHERE number_of_votes > 500000
ORDER BY number_of_votes DESC
LIMIT 10"""
pd.read_sql(q,conn)

                                       primary_title  number_of_votes
0                                    The Dark Knight          2741213
1                                          Inception          2432540
2                                       Interstellar          1938559
3  The Lord of the Rings: The Fellowship of the Ring          1927480
4      The Lord of the Rings: The Return of the King          1899060
5                              The Dark Knight Rises          1754338
6              The Lord of the Rings: The Two Towers          1713825
7                                   Django Unchained          1613387
8                                          Gladiator          1546218
9                                      Batman Begins          1514561